import { Link, useNavigate } from "react-router-dom";
import "./member.css";
import { useState } from "react";
import Swal from "sweetalert2";
const Agreement = () => {
  // 체크박스 상태 (필수 약관 1, 필수 약관 2)
  const [isChecked1, setIsChecked1] = useState(false);
  const [isChecked2, setIsChecked2] = useState(false);

  // 첫 번째 약관 체크박스 변경 시 실행
  const checkBox1 = (e) => {
    setIsChecked1(e.target.checked);
  };
   // 두 번째 약관 체크박스 변경 시 실행
  const checkBox2 = (e) => {
    setIsChecked2(e.target.checked);
  };

  const navigate = useNavigate();
  // "다음" 버튼 클릭 시 실행
  // 두 개의 필수 약관 체크 여부 확인 → 모두 체크 시 회원가입 페이지로 이동
  const nextPage = () => {
    if (isChecked1 && isChecked2) {
      navigate("/member/join");
    } else {
      Swal.fire({
        text: "약관동의를 모두 체크해주세요",
        icon: "warning",
      });
    }
  };
   // "이전" 버튼 클릭 시 메인 페이지로 이동
  const prevPage = () => {
    navigate("/");
  };
  return (
    <section className="agree-wrap">
      <div className="page-title">약관동의</div>
      <form>
        <div className="agree-content-wrap">
          <div className="box-title">
            <div>1. 개인정보 취급동의</div>
            <div className="necessary">(필수)</div>
          </div>
          <div className="contents">
            <p>
              Atelierism(이하 “회사” 라고 한다)은 개인정보보호법 제30조에 따라
              정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고
              원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보
              처리지침을 수립/공개합니다.회사는 정보통신서비스제공자가
              준수하여야 하는 대한민국의 관계 법령 (개인정보보호법, 정보통신망
              이용촉진 및 정보보호 등에 관한 법률, 통신비밀보호법,
              전기통신사업법 등)을 준수하며, 관련 법령에 의거한
              개인정보처리방침을 정하여 이용자 권익 보호에 최선을 다하고
              있습니다.본 개인정보처리방침은 회사가 제공하는 소프트웨어
              서비스(모바일 웹/앱 포함)의 이용에 적용되며, 본 방침에서 정하지
              않은 사항은 회사 소프트웨어 이용약관의 내용을 준용합니다. **제 1조
              개인정보의 처리목적** 서비스 제공에 필요한 범위 내의 정보수집 -
              이용자에게 몇가지 설문 조사를 바탕으로 맞춤형 인테리어 디자인
              콘텐츠 서비스 제공이용자에게 홈퍼니싱 시뮬레이션 혹은 쇼룸을
              제공하고, 이용자의 관심 / 행태정보를 이용해 가구 및 자재를
              추천하여 구매를 편리하게 하는 서비스 제공 이용자별 서비스 콘텐츠
              결과를 저장하고 전자상거래를 포함한 인테리어 콘텐츠 서비스 제공나.
              마케팅 · 광고에의 활용 (선택)통계학적 특성에 따른 광고 전송 및
              이벤트 개최 **제 2조 개인정보의 처리 및 보유기간** 회사는 법령에
              따른 개인정보 보유/이용기간 또는 정보주체로부터 개인정보를
              수집시에 동의받은 개인정보 보유/이용기간 내에서 개인정보를
              처리/보유합니다.회사가 이용자로부터 수집하여 처리하는 정보의
              구체적인 내용과 해당 정보에 대한 보유근거 및 보유기간은 아래와
              같습니다. 1. 시숲은 회원의 개인정보를 원칙적으로 보유/이용기간의
              경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는
              지체없이 해당 개인정보를 파기합니다. 2. 원으로부터 동의받은
              개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고
              다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는 해당
              개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여
              보존합니다. 3. 시숲은 1년동안 회사의 서비스를 이용하지 않은 회원의
              개인정보는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률 제
              29조’에 근거하여 회원에게 사전통지하고 개인정보를 파기하거나
              별도로 분리하여 저장합니다.(회사는 개인정보가 파기되거나 분리되어
              저장/관리된다는 사실, 서비스 미이용기간 만료일, 해당 개인정보의
              항목을 E-mail 등의 방법으로 미이용기간 30일전에 회원에게 알립니다.
              이를 위해 회원은 회사에게 정확한 연락처 정보를 알리거나 수정해야
              합니다. 4. 관련 법률에 따른 정보보유 사유는 아래와 같습니다.
              서비스 결제 및 정산 발생시 관련 법률에 따라 개인정보를 포함한
              결제, 정산 관련 정보가 5년간 보관이 됩니다. 5. 전자상거래 등에서의
              소비자 보호에 관한 법률 6. 계약 또는 청약철회 등에 관한 기록 : 5년
              7. 대금결제 및 재화 등의 공급에 관한 기록 : 5년 8. 소비자의 불만
              또는 분쟁처리에 관한 기록 : 3년 9. 통신비밀보호법 - 로그인 기록 :
              3개월 10. 조세 관련 법령 - 매출 관련 기록 : 5년 11. 개인정보
              파기절차 – 회사는 파기사유가 발생한 개인정보를 개인정보
              보호책임자의 승인 절차를 거쳐 파기합니다. 12. 개인정보 파기방법 –
              회사는 전자적 파일형태로 기록/저장된 개인정보는 기록을 재생할 수
              없도록 기술적인 방법 또는 물리적인 방법을 이용하여 파기하며,
              종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각 등을 통하여
              파기합니다. **제 3조 개인정보의 공유 및 제공** 1. 시숲은
              원칙적으로 회원의 동의 없이 개인정보를 제3자에게 제공하지 않으며
              개인정보를 제3자에게 제공해야 하는 경우 법령에 따른 동의를 받고
              있습니다. 2. 시숲은 개인정보를 ‘개인정보 수집항목 및 목적’에서
              명시한 범위 내에서 사용하며 회원의 사전 동의 없이 개인정보 수집
              이용 목적 범위를 초과하여 이용하거나 회원의 개인정보를 제공하지
              않습니다. 3. 다만 아래와 같이 양질의 서비스 제공을 위해 이용자의
              개인정보를 협력업체와 공유할 필요가 있는 경우 제공 받는 자,
              제공목적, 제공정보 항목, 이용 및 보유기간 등을 회원에게 고지하여
              동의를 구하거나 관련법령에 따른 경우는 예외로 합니다. 4. 회원이
              사전에 공개 또는 제3자 제공에 동의한 경우 : 대표적으로 구매자의
              개인정보를 디자이너에게 제공하는 경우, 디자이너의 개인정보를
              구매자에게 제공하는 경우가 제3자제공의 예입니다. 디자이너의
              개인정보는 일반적으로 회원을 포함한 제3자에게 공개되며(가입시
              사전에 포괄적 제3자 제공동의를 받습니다.) 구매자의 개인정보는
              디자이너의 물품(서비스) 구매결제가 완료된 이후 디자이너에게
              제공됩니다. 5. 관계법령의 규정에 의거하거나, 수사목적으로 법령에
              정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우 **제 4조
              정보주체의 권리와 그 행사방법** 회사는 이용자의 권리를 다음과 같이
              보장하고 있습니다. 1. 이용자는 언제든지 등록되어 있는 자신의
              개인정보를 조회 할 수 있으며, 회사의 개인정보의 처리에 동의하지
              않는 경우 동의를 거부하거나 정보삭제를 요청할 수 있습니다. 다만,
              그러한 경우 서비스의 일부 또는 전부 이용이 어려울 수 있습니다. 2.
              이용자의 개인정보 조회, 수정을 위해서는 회사의 개인정보
              보호책임자에게 서면, 전화 또는 이메일로 연락함으로써 개인정보의
              조회, 수정, 삭제를 요청할 수 있습니다. 3. 위와 같은 권리행사는
              정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 할 수
              있습니다. 단, 이 경우 개인정보보호법 시행규칙 별지 제11호 서식에
              따른 위임장을 제출하여야 합니다. 4. 회사는 이용자의 요청에 의해
              해지 또는 삭제된 개인정보를 5. 개인정보의 파기에 관한 사항에
              명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수
              없도록 처리하고 있습니다.
            </p>
          </div>
          <div className="check-box">
            <label>
              동의합니다
              <input type="checkbox" name="agree" onChange={checkBox1} />
            </label>
          </div>
        </div>

        <div className="agree-content-wrap">
          <div className="box-title">
            <div>2. 이용약관</div>
            <div className="necessary">(필수)</div>
          </div>
          <div className="contents">
            <p>
              **제 1조 ( 목적 )** Atelierism (이하 “아뜰리에리즘“이라 합니다)
              서비스 이용 약관은 Atelierism (이하 “회사“라 합니 다) 가 제공하는
              Atelierism 서비스(이하 ‘서비스’라 합니다)와 관련하여, 회사와 이용
              자 및 이용자간의 권리, 의무 및 책임 사항, 기타 필요한 사항을
              규정함을 목적으로 합니다. **제 2조 ( 용어 )** 1. 이 약관에서
              사용하는 용어의 정의는 다음과 같습니다. a. Atelierism ( 이하
              “아뜰리에리즘“이라 합니다 ) : 회사가 운영하는 모바일
              어플리케이션으로 서, 이용자가 PC, 휴대형 단말기, 태블릿 PC 등 각종
              유무선 기기 또는 프로그램 을 통하여 이용할 수 있도록 재화 또는
              용역에 대한 가격 등 정보를 제공하는 가상의 영업장을 말합니다. b.
              회원 : 회사에 개인정보를 제공하여 회원 등록을 한 자로서, 회사의
              정보를 지속 적으로 제공받으며, 회사가 제공하는 서비스를 계속적으로
              이용할 수 있는 고객을 포괄적으로 의미합니다. c. 디자이너 :
              셀프인테리어 컨설팅 관련 서비스나 제품을 판매하는 직종에 종사 하는
              회원 중 회사가 지정한 절차 및 검수를 마치고 해당 회원의 서비스와
              제품에 대한 정보 및 상담을 제공할 수 있는 회원을 의미합니다. 본
              약관에서 별도로 전문가를 언급하지 않는 경우에는 모든 약관의
              조항들이 디자이너에게도 회원과 동일하게 적용됩니다. d. 회원정보 :
              회사가 가입 신청자에게 회원가입 신청양식(이하 “신청양식“이라 합니
              다)에 기재를 요청하는 가입신청자의 개인정보와 회원의 식별과 서비스
              이용을 위하여 회원이 입력하고 서비스 내 공개된 개인정보를
              의미합니다. e. 디자이너 정보 : 전문가가 되기 위해 회사가 지정한
              절차 및 검수 과정에서 기재 하는 전문가의 정보를 의미합니다. 2.
              제1항에서 정의되지 않은 이 약관상의 용어의 의미는 일반적인 거래
              관행에 의합니다. **제 3조 (약관의 효력 및 변경)** 1. 회사는 이
              약관의 내용을 회사의 상호, 영업소 소재지, 대표자의 성명, 사업자
              등록번호, 연락처(전화, 팩스, 전자우편주소 등)등과 함께 회원이
              확인할 수 있도록 시숲 회사 정보 화면에 게시합니다. 2. 회사는
              약관의 규제에 관한 법률, 전자문서 및 전자거래 기본법, 전자서명법,
              정보통신망 이용 촉진 및 정보보호등에 관한 법률(이하
              “정보통신망법“이라 함) 등 관련법을 위배하지 않는 범위에서 본
              약관을 개정할 수 있습니다. 3. 회사가 약관을 개정할 경우에는
              적용일자 및 개정사유를 명시하여 현행 약관과 함께 공지사항에 그
              적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 4. 회사가 전
              항에 따라 개정약관을 공지할 때에 이용자가 명시적으로 거부의 의사
              를 표시하지 않거나 이용계약을 해지하지 않는 경우 개정약관에 동의한
              것으로 봅니다. 5. 회사가 이용자에게 이용약관의 변경을
              공지하였음에도 불구하고 이용자가 이를 알지 못하여 발생하는 피해에
              대하여 회사는 책임지지 않습니다. 6. 이 약관에서 정하지 아니한
              사항과 이 약관의 해석에 관하여는 전자상거래 등에 서의 소비자보호에
              관한 법률, 약관의 규제 등에 관한 법률, 공정 거래 위원회가 정하는
              전자상거래 등에서의 소비자 보호지침 및 관계법령 또는 상 관례에
              따릅 니다.**제 4조 ( 서비스의 제공 및 변경 )** 1. 회사는 다음과
              같은 업무를 수행합니다. 1. 국내 쇼핑몰에서 판매되는 상품의 정보와
              가격을 제공함으로써 판매회원 및 제휴사와 구매자 사이에 원활하고
              효율적인 거래를 위한 마켓 서비스를 제공하는 중개서비스 2. 인테리어
              컨설팅이 가능한 디자이너와 인테리어를 희망하는 고객 사이 에서
              매칭해주는 중개 서비스 3. 회원간의 활발한 정보공유의 장을 마련하기
              위한 커뮤니티 SNS 서비스 4. 기타 본 조항에 정한 업무에 부수한 업무
              2. 회사는 재화 또는 용역의 변경 등의 경우에는 장차 체결되는 계약에
              의해 제공 할 재화 또는 용역의 내용을 변경할 수 있습니다. 이
              경우에는 변경된 재화 또는 용역의 내용 및 제공 일자를 명시하여
              현재의 재화 또는 용역의 내용을 게시한 곳에 즉시 공지합니다. 3.
              회사가 제공하기로 이용자와 계약을 체결한 서비스의 내용을 재화 등의
              기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를 이용
              자에게 통지 가능한 연락처로 즉시 통지합니다. 4. 회사가 제공하는
              서비스는 이용자와 제휴사 간에 재화 또는 용역을 거래할 수 있도록
              시숲의 이용을 허락하거나, 통신판매를 중개하고 재화 또는 용역의
              정보만을 제공하는 것을 목적으로 하며, 회사는 제휴사가 시숲에
              제공하는 재화 또는 용역의 정보에 관련해서는 일체의 책임을 지지
              않습니다. 5. 전항의 경우 회사는 이로 인하여 이용자가 입은 손해를
              배상합니다. 다만, 회사가 고의 또는 과실이 없음을 입증하는 경우에는
              그러하지 아니합니다. **제 5조 ( 서비스 이용료 )** 회사는 회원 간의
              자유로운 전자상거래에 있어서 필요로 하는 각종 서비스를 제공 하고
              회사의 내부 정책에 따라 그에 대한 이용료(서비스 이용료)를 부과할
              수 있습니다. **제 6조 ( 서비스의 중단 )** 1. 회사는 컴퓨터 등
              정보통신설비의 보수점검 교체 및 고장, 통신의 두절 등의 사유가
              발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 2.
              사업종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를
              제공 할 수 없게 되는 경우에는 회사는 회사가 정한 방법으로
              이용자에게 통지하고 당초 회사에서 제시한 조건에 따라 소비자에게
              보상합니다.**제 7조( 회원가입 )** 1. 이용자는 회사가 정한 가입
              양식에 따라 회원정보를 기입한 후 이 약관에 동의 한다는 의사표시를
              함으로서 회원가입을 신청합니다. 2. 회사는 가입신청자의 신청에
              대하여 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 회사는 다음
              각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후 에
              이용계약을 해지할 수 있습니다. 1. 가입신청자가 이 약관에 의하여
              이전에 회원자격을 상실한 적이 있는 경우. 단, 회사의 회원 재가입
              승낙을 얻은 경우에는 예외로 함. 2. 실명이 아니거나 타인의 명의를
              이용한 경우 3. 허위의 정보를 기재하거나, 회사가 제시하는 내용을
              기재하지 않은 경우 4. 14세 미만 아동이 법정대리인(부모 등)의
              동의를 얻지 아니한 경우 5. 이용자의 귀책사유로 인하여 승낙이
              불가능하거나 기타 사항을 위반하여 신청 하는 경우 3. 전항의 규정에
              따라 회원가입 신청의 승낙을 하지 아니하거나 유보한 경우, 회사는
              원칙적으로 이를 가입 신청자에게 알리도록 합니다. 4. 이용 계약의
              성립 시기는 회사가 가입 완료를 신청 절차상에서 표시한 시점으로
              합니다. 5. 회원은 회원 가입 시 등록한 사항에 변경이 있는 경우,
              상당한 기간 이내에 “몰” 에 대하여 회원 정보 수정 등의 방법으로 그
              변경 사항을 알려야 합니다. 6. 전항의 경우 수정하지 않은 정보로
              인하여 발생하는 손해는 당해 회원이 전적 으로 부담하며, 회사는 이에
              대하여 아무런 책임을 지지 않습니다. **제 8조 ( 아이디 및
              비밀번호의 관리 )** 1. 아이디(ID) 및 비밀번호에 대한 관리책임은
              회원에게 있으며, 회원은 어떠한 경우에도 본인의 아이디(ID) 또는
              비밀번호를 타인에게 양도하거나 대여할 수 없습니다. 2. 회사의
              귀책사유 없이 아이디(ID) 또는 비밀번호의 유출, 양도, 대여로 인하여
              발생하는 손실이나 손해에 대하여 이용자 본인이 그에 대한 책임을
              부담합니다. 3. 회원은 아이디(ID) 또는 비밀번호를 도난 당하거나
              제3자가 무단으로 사용하고 있음을 인지한 경우, 즉시 회사에
              통보하여야 하고 회사는 이에 대한 신속한 처리를 위하여 최선의
              노력을 다하여야 합니다.
            </p>
          </div>
          <div className="check-box">
            <label>
              동의합니다
              <input type="checkbox" name="agree" onChange={checkBox2} />
            </label>
          </div>
          <div className="sb-button-zone">
            <button type="button" onClick={prevPage} style={{ color: "#000" }}>
              이전
            </button>
            <button type="button" onClick={nextPage}>
              다음
            </button>
          </div>
        </div>
      </form>
    </section>
  );
};
export default Agreement;
